kmorimatsu/fuzixapps/fzkmmega/p32mx370f.h
/*

	PIC32MX SFR wrapper for FZ/KM

	All SFR (for example, WDTCON) are handled as 8 bit registers.

	To output 16 and 32 bits to SFR, use:
		SFRbits0815 for bits 8-15,
		SFRbits1623 for bits 16-23, and
		SFRbits2431 for bits 24-31,
	then use SFR.
	For example:
		SFRbits0815=0x00;
		TMR2=0x00;
		SFRbits0815=0x1f;
		PR2=0xff;
	, to set TMR2 and PR2 to 0x0000 and 0x1fff, respectively.

	To input 16 and 32 bits from SFR, use SFR first, then use:
		SFRbits0815 for bits 8-15,
		SFRbits1623 for bits 16-23, and
		SFRbits2431 for bits 24-31.
	For example,
		uint16_t tmr2;
		tmr2=TMR2;
		tmr2|=SFRbits0815<<8;
	, to get TMR2 value to the variable, tmr2.

*/

__sfr __at 0x41 SFRbits0815;
__sfr __at 0x42 SFRbits1623;
__sfr __at 0x43 SFRbits2431;

/*
	Macros for input/output 8/16/32 bit data to/from SFR
		p32sfr8in( SFR );
		p32sfr16in( SFR );
		p32sfr32in( SFR );
		p32sfr8out( SFR , data );
		p32sfr16out( SFR , data );
		p32sfr32out( SFR , data );
	, where "SFR" is PIC32MX SFR (for example, WDTCON) and "data" is data to output/input.
	
	For example:
		uint16_t tmr2;
		p32sfr16out(TMR2,0x0000);
		p32sfr16out(PR2,0x1fff);
		tmr2=p32sfr16in(TMR2);
	, to set TMR2 and PR2 to 0x0000 and 0x1fff, respectively, and to get TMR value to tmr2.
*/

#define p32sfr8in(s) s
#define p32sfr16in(s) ( s | (SFRbits0815<<8) )
#define p32sfr32in(s) ( s | (SFRbits0815<<8) | (SFRbits1623<<16) )
#define p32sfr8out(s,d) do {\
		s=(d);\
	} while(0)
#define p32sfr16out(s,d) do {\
		SFRbits0815=(d)>>8;\
		s=(d);\
	} while(0)
#define p32sfr32out(s,d) do {\
		SFRbits1623=(d)>>16;\
		SFRbits0815=(d)>>8;\
		s=(d);\
	} while(0)

/*
	Assignments of Z80 I/O addresses bits to SFR bits are as follows:
	
		SFRbit0
		SFRbit1
		SFRbit2  - A0
		SFRbit3  - A1
		SFRbit4  - A2
		SFRbit5  - A3
		SFRbit6  - A4
		SFRbit7  - A5
		SFRbit8  - A8
		SFRbit9  - A9
		SFRbit10 - A10
		SFRbit11 - A11
		SFRbit12 - A12
		SFRbit13 - A13
		SFRbit14 - A14
		SFRbit15 - A15
		SFRbit16
		SFRbit17
		SFRbit18
		SFRbit19 - A6
	
	Calculation of SFR address from Z80 I/O address (as B and C registers) is done as follows:
	
		0xBF800000 | ((C&0x40)<<13 | (B<<8) | ((C&0x3f)<<2)
	
	Caculation of Z80 I/O address (as B and C registers) from SFR address is done as follows:
	
		B=(SFR>>8)&0xff;
		C=((SFR>>2)&0x3f) | ((SFR>>13)&0x40) | 0x80;
*/

__sfr __banked __at 0x0080 WDTCON;
__sfr __banked __at 0x0081 WDTCONCLR;
__sfr __banked __at 0x0082 WDTCONSET;
__sfr __banked __at 0x0083 WDTCONINV;
__sfr __banked __at 0x0280 RTCCON;
__sfr __banked __at 0x0281 RTCCONCLR;
__sfr __banked __at 0x0282 RTCCONSET;
__sfr __banked __at 0x0283 RTCCONINV;
__sfr __banked __at 0x0284 RTCALRM;
__sfr __banked __at 0x0285 RTCALRMCLR;
__sfr __banked __at 0x0286 RTCALRMSET;
__sfr __banked __at 0x0287 RTCALRMINV;
__sfr __banked __at 0x0288 RTCTIME;
__sfr __banked __at 0x0289 RTCTIMECLR;
__sfr __banked __at 0x028a RTCTIMESET;
__sfr __banked __at 0x028b RTCTIMEINV;
__sfr __banked __at 0x028c RTCDATE;
__sfr __banked __at 0x028d RTCDATECLR;
__sfr __banked __at 0x028e RTCDATESET;
__sfr __banked __at 0x028f RTCDATEINV;
__sfr __banked __at 0x0290 ALRMTIME;
__sfr __banked __at 0x0291 ALRMTIMECLR;
__sfr __banked __at 0x0292 ALRMTIMESET;
__sfr __banked __at 0x0293 ALRMTIMEINV;
__sfr __banked __at 0x0294 ALRMDATE;
__sfr __banked __at 0x0295 ALRMDATECLR;
__sfr __banked __at 0x0296 ALRMDATESET;
__sfr __banked __at 0x0297 ALRMDATEINV;
__sfr __banked __at 0x0680 T1CON;
__sfr __banked __at 0x0681 T1CONCLR;
__sfr __banked __at 0x0682 T1CONSET;
__sfr __banked __at 0x0683 T1CONINV;
__sfr __banked __at 0x0684 TMR1;
__sfr __banked __at 0x0685 TMR1CLR;
__sfr __banked __at 0x0686 TMR1SET;
__sfr __banked __at 0x0687 TMR1INV;
__sfr __banked __at 0x0688 PR1;
__sfr __banked __at 0x0689 PR1CLR;
__sfr __banked __at 0x068a PR1SET;
__sfr __banked __at 0x068b PR1INV;
__sfr __banked __at 0x0880 T2CON;
__sfr __banked __at 0x0881 T2CONCLR;
__sfr __banked __at 0x0882 T2CONSET;
__sfr __banked __at 0x0883 T2CONINV;
__sfr __banked __at 0x0884 TMR2;
__sfr __banked __at 0x0885 TMR2CLR;
__sfr __banked __at 0x0886 TMR2SET;
__sfr __banked __at 0x0887 TMR2INV;
__sfr __banked __at 0x0888 PR2;
__sfr __banked __at 0x0889 PR2CLR;
__sfr __banked __at 0x088a PR2SET;
__sfr __banked __at 0x088b PR2INV;
__sfr __banked __at 0x0a80 T3CON;
__sfr __banked __at 0x0a81 T3CONCLR;
__sfr __banked __at 0x0a82 T3CONSET;
__sfr __banked __at 0x0a83 T3CONINV;
__sfr __banked __at 0x0a84 TMR3;
__sfr __banked __at 0x0a85 TMR3CLR;
__sfr __banked __at 0x0a86 TMR3SET;
__sfr __banked __at 0x0a87 TMR3INV;
__sfr __banked __at 0x0a88 PR3;
__sfr __banked __at 0x0a89 PR3CLR;
__sfr __banked __at 0x0a8a PR3SET;
__sfr __banked __at 0x0a8b PR3INV;
__sfr __banked __at 0x0c80 T4CON;
__sfr __banked __at 0x0c81 T4CONCLR;
__sfr __banked __at 0x0c82 T4CONSET;
__sfr __banked __at 0x0c83 T4CONINV;
__sfr __banked __at 0x0c84 TMR4;
__sfr __banked __at 0x0c85 TMR4CLR;
__sfr __banked __at 0x0c86 TMR4SET;
__sfr __banked __at 0x0c87 TMR4INV;
__sfr __banked __at 0x0c88 PR4;
__sfr __banked __at 0x0c89 PR4CLR;
__sfr __banked __at 0x0c8a PR4SET;
__sfr __banked __at 0x0c8b PR4INV;
__sfr __banked __at 0x0e80 T5CON;
__sfr __banked __at 0x0e81 T5CONCLR;
__sfr __banked __at 0x0e82 T5CONSET;
__sfr __banked __at 0x0e83 T5CONINV;
__sfr __banked __at 0x0e84 TMR5;
__sfr __banked __at 0x0e85 TMR5CLR;
__sfr __banked __at 0x0e86 TMR5SET;
__sfr __banked __at 0x0e87 TMR5INV;
__sfr __banked __at 0x0e88 PR5;
__sfr __banked __at 0x0e89 PR5CLR;
__sfr __banked __at 0x0e8a PR5SET;
__sfr __banked __at 0x0e8b PR5INV;
__sfr __banked __at 0x2080 IC1CON;
__sfr __banked __at 0x2081 IC1CONCLR;
__sfr __banked __at 0x2082 IC1CONSET;
__sfr __banked __at 0x2083 IC1CONINV;
__sfr __banked __at 0x2084 IC1BUF;
__sfr __banked __at 0x2280 IC2CON;
__sfr __banked __at 0x2281 IC2CONCLR;
__sfr __banked __at 0x2282 IC2CONSET;
__sfr __banked __at 0x2283 IC2CONINV;
__sfr __banked __at 0x2284 IC2BUF;
__sfr __banked __at 0x2480 IC3CON;
__sfr __banked __at 0x2481 IC3CONCLR;
__sfr __banked __at 0x2482 IC3CONSET;
__sfr __banked __at 0x2483 IC3CONINV;
__sfr __banked __at 0x2484 IC3BUF;
__sfr __banked __at 0x2680 IC4CON;
__sfr __banked __at 0x2681 IC4CONCLR;
__sfr __banked __at 0x2682 IC4CONSET;
__sfr __banked __at 0x2683 IC4CONINV;
__sfr __banked __at 0x2684 IC4BUF;
__sfr __banked __at 0x2880 IC5CON;
__sfr __banked __at 0x2881 IC5CONCLR;
__sfr __banked __at 0x2882 IC5CONSET;
__sfr __banked __at 0x2883 IC5CONINV;
__sfr __banked __at 0x2884 IC5BUF;
__sfr __banked __at 0x3080 OC1CON;
__sfr __banked __at 0x3081 OC1CONCLR;
__sfr __banked __at 0x3082 OC1CONSET;
__sfr __banked __at 0x3083 OC1CONINV;
__sfr __banked __at 0x3084 OC1R;
__sfr __banked __at 0x3085 OC1RCLR;
__sfr __banked __at 0x3086 OC1RSET;
__sfr __banked __at 0x3087 OC1RINV;
__sfr __banked __at 0x3088 OC1RS;
__sfr __banked __at 0x3089 OC1RSCLR;
__sfr __banked __at 0x308a OC1RSSET;
__sfr __banked __at 0x308b OC1RSINV;
__sfr __banked __at 0x3280 OC2CON;
__sfr __banked __at 0x3281 OC2CONCLR;
__sfr __banked __at 0x3282 OC2CONSET;
__sfr __banked __at 0x3283 OC2CONINV;
__sfr __banked __at 0x3284 OC2R;
__sfr __banked __at 0x3285 OC2RCLR;
__sfr __banked __at 0x3286 OC2RSET;
__sfr __banked __at 0x3287 OC2RINV;
__sfr __banked __at 0x3288 OC2RS;
__sfr __banked __at 0x3289 OC2RSCLR;
__sfr __banked __at 0x328a OC2RSSET;
__sfr __banked __at 0x328b OC2RSINV;
__sfr __banked __at 0x3480 OC3CON;
__sfr __banked __at 0x3481 OC3CONCLR;
__sfr __banked __at 0x3482 OC3CONSET;
__sfr __banked __at 0x3483 OC3CONINV;
__sfr __banked __at 0x3484 OC3R;
__sfr __banked __at 0x3485 OC3RCLR;
__sfr __banked __at 0x3486 OC3RSET;
__sfr __banked __at 0x3487 OC3RINV;
__sfr __banked __at 0x3488 OC3RS;
__sfr __banked __at 0x3489 OC3RSCLR;
__sfr __banked __at 0x348a OC3RSSET;
__sfr __banked __at 0x348b OC3RSINV;
__sfr __banked __at 0x3680 OC4CON;
__sfr __banked __at 0x3681 OC4CONCLR;
__sfr __banked __at 0x3682 OC4CONSET;
__sfr __banked __at 0x3683 OC4CONINV;
__sfr __banked __at 0x3684 OC4R;
__sfr __banked __at 0x3685 OC4RCLR;
__sfr __banked __at 0x3686 OC4RSET;
__sfr __banked __at 0x3687 OC4RINV;
__sfr __banked __at 0x3688 OC4RS;
__sfr __banked __at 0x3689 OC4RSCLR;
__sfr __banked __at 0x368a OC4RSSET;
__sfr __banked __at 0x368b OC4RSINV;
__sfr __banked __at 0x3880 OC5CON;
__sfr __banked __at 0x3881 OC5CONCLR;
__sfr __banked __at 0x3882 OC5CONSET;
__sfr __banked __at 0x3883 OC5CONINV;
__sfr __banked __at 0x3884 OC5R;
__sfr __banked __at 0x3885 OC5RCLR;
__sfr __banked __at 0x3886 OC5RSET;
__sfr __banked __at 0x3887 OC5RINV;
__sfr __banked __at 0x3888 OC5RS;
__sfr __banked __at 0x3889 OC5RSCLR;
__sfr __banked __at 0x388a OC5RSSET;
__sfr __banked __at 0x388b OC5RSINV;
__sfr __banked __at 0x5080 I2C1CON;
__sfr __banked __at 0x5080 I2C1111CON;
__sfr __banked __at 0x5081 I2C1CONCLR;
__sfr __banked __at 0x5081 I2C1111CONCLR;
__sfr __banked __at 0x5082 I2C1CONSET;
__sfr __banked __at 0x5082 I2C1111CONSET;
__sfr __banked __at 0x5083 I2C1CONINV;
__sfr __banked __at 0x5083 I2C1111CONINV;
__sfr __banked __at 0x5084 I2C1STAT;
__sfr __banked __at 0x5084 I2C1111STAT;
__sfr __banked __at 0x5085 I2C1STATCLR;
__sfr __banked __at 0x5085 I2C1111STATCLR;
__sfr __banked __at 0x5086 I2C1STATSET;
__sfr __banked __at 0x5086 I2C1111STATSET;
__sfr __banked __at 0x5087 I2C1STATINV;
__sfr __banked __at 0x5087 I2C1111STATINV;
__sfr __banked __at 0x5088 I2C1ADD;
__sfr __banked __at 0x5088 I2C1111ADD;
__sfr __banked __at 0x5089 I2C1ADDCLR;
__sfr __banked __at 0x5089 I2C1111ADDCLR;
__sfr __banked __at 0x508a I2C1ADDSET;
__sfr __banked __at 0x508a I2C1111ADDSET;
__sfr __banked __at 0x508b I2C1ADDINV;
__sfr __banked __at 0x508b I2C1111ADDINV;
__sfr __banked __at 0x508c I2C1MSK;
__sfr __banked __at 0x508c I2C1111MSK;
__sfr __banked __at 0x508d I2C1MSKCLR;
__sfr __banked __at 0x508d I2C1111MSKCLR;
__sfr __banked __at 0x508e I2C1MSKSET;
__sfr __banked __at 0x508e I2C1111MSKSET;
__sfr __banked __at 0x508f I2C1MSKINV;
__sfr __banked __at 0x508f I2C1111MSKINV;
__sfr __banked __at 0x5090 I2C1BRG;
__sfr __banked __at 0x5090 I2C1111BRG;
__sfr __banked __at 0x5091 I2C1BRGCLR;
__sfr __banked __at 0x5091 I2C1111BRGCLR;
__sfr __banked __at 0x5092 I2C1BRGSET;
__sfr __banked __at 0x5092 I2C1111BRGSET;
__sfr __banked __at 0x5093 I2C1BRGINV;
__sfr __banked __at 0x5093 I2C1111BRGINV;
__sfr __banked __at 0x5094 I2C1TRN;
__sfr __banked __at 0x5094 I2C1111TRN;
__sfr __banked __at 0x5095 I2C1TRNCLR;
__sfr __banked __at 0x5095 I2C1111TRNCLR;
__sfr __banked __at 0x5096 I2C1TRNSET;
__sfr __banked __at 0x5096 I2C1111TRNSET;
__sfr __banked __at 0x5097 I2C1TRNINV;
__sfr __banked __at 0x5097 I2C1111TRNINV;
__sfr __banked __at 0x5098 I2C1RCV;
__sfr __banked __at 0x5098 I2C1111RCV;
__sfr __banked __at 0x5180 I2C2CON;
__sfr __banked __at 0x5180 I2CABCON;
__sfr __banked __at 0x5181 I2C2CONCLR;
__sfr __banked __at 0x5181 I2CABCONCLR;
__sfr __banked __at 0x5182 I2C2CONSET;
__sfr __banked __at 0x5182 I2CABCONSET;
__sfr __banked __at 0x5183 I2C2CONINV;
__sfr __banked __at 0x5183 I2CABCONINV;
__sfr __banked __at 0x5184 I2C2STAT;
__sfr __banked __at 0x5184 I2CABSTAT;
__sfr __banked __at 0x5185 I2C2STATCLR;
__sfr __banked __at 0x5185 I2CABSTATCLR;
__sfr __banked __at 0x5186 I2C2STATSET;
__sfr __banked __at 0x5186 I2CABSTATSET;
__sfr __banked __at 0x5187 I2C2STATINV;
__sfr __banked __at 0x5187 I2CABSTATINV;
__sfr __banked __at 0x5188 I2C2ADD;
__sfr __banked __at 0x5188 I2CABADD;
__sfr __banked __at 0x5189 I2C2ADDCLR;
__sfr __banked __at 0x5189 I2CABADDCLR;
__sfr __banked __at 0x518a I2C2ADDSET;
__sfr __banked __at 0x518a I2CABADDSET;
__sfr __banked __at 0x518b I2C2ADDINV;
__sfr __banked __at 0x518b I2CABADDINV;
__sfr __banked __at 0x518c I2C2MSK;
__sfr __banked __at 0x518c I2CABMSK;
__sfr __banked __at 0x518d I2C2MSKCLR;
__sfr __banked __at 0x518d I2CABMSKCLR;
__sfr __banked __at 0x518e I2C2MSKSET;
__sfr __banked __at 0x518e I2CABMSKSET;
__sfr __banked __at 0x518f I2C2MSKINV;
__sfr __banked __at 0x518f I2CABMSKINV;
__sfr __banked __at 0x5190 I2C2BRG;
__sfr __banked __at 0x5190 I2CABBRG;
__sfr __banked __at 0x5191 I2C2BRGCLR;
__sfr __banked __at 0x5191 I2CABBRGCLR;
__sfr __banked __at 0x5192 I2C2BRGSET;
__sfr __banked __at 0x5192 I2CABBRGSET;
__sfr __banked __at 0x5193 I2C2BRGINV;
__sfr __banked __at 0x5193 I2CABBRGINV;
__sfr __banked __at 0x5194 I2C2TRN;
__sfr __banked __at 0x5194 I2CABTRN;
__sfr __banked __at 0x5195 I2C2TRNCLR;
__sfr __banked __at 0x5195 I2CABTRNCLR;
__sfr __banked __at 0x5196 I2C2TRNSET;
__sfr __banked __at 0x5196 I2CABTRNSET;
__sfr __banked __at 0x5197 I2C2TRNINV;
__sfr __banked __at 0x5197 I2CABTRNINV;
__sfr __banked __at 0x5198 I2C2RCV;
__sfr __banked __at 0x5198 I2CABRCV;
__sfr __banked __at 0x5880 SPI1CON;
__sfr __banked __at 0x5881 SPI1CONCLR;
__sfr __banked __at 0x5882 SPI1CONSET;
__sfr __banked __at 0x5883 SPI1CONINV;
__sfr __banked __at 0x5884 SPI1STAT;
__sfr __banked __at 0x5885 SPI1STATCLR;
__sfr __banked __at 0x5886 SPI1STATSET;
__sfr __banked __at 0x5887 SPI1STATINV;
__sfr __banked __at 0x5888 SPI1BUF;
__sfr __banked __at 0x588c SPI1BRG;
__sfr __banked __at 0x588d SPI1BRGCLR;
__sfr __banked __at 0x588e SPI1BRGSET;
__sfr __banked __at 0x588f SPI1BRGINV;
__sfr __banked __at 0x5890 SPI1CON2;
__sfr __banked __at 0x5891 SPI1CON2CLR;
__sfr __banked __at 0x5892 SPI1CON2SET;
__sfr __banked __at 0x5893 SPI1CON2INV;
__sfr __banked __at 0x5a80 SPI2CON;
__sfr __banked __at 0x5a81 SPI2CONCLR;
__sfr __banked __at 0x5a82 SPI2CONSET;
__sfr __banked __at 0x5a83 SPI2CONINV;
__sfr __banked __at 0x5a84 SPI2STAT;
__sfr __banked __at 0x5a85 SPI2STATCLR;
__sfr __banked __at 0x5a86 SPI2STATSET;
__sfr __banked __at 0x5a87 SPI2STATINV;
__sfr __banked __at 0x5a88 SPI2BUF;
__sfr __banked __at 0x5a8c SPI2BRG;
__sfr __banked __at 0x5a8d SPI2BRGCLR;
__sfr __banked __at 0x5a8e SPI2BRGSET;
__sfr __banked __at 0x5a8f SPI2BRGINV;
__sfr __banked __at 0x5a90 SPI2CON2;
__sfr __banked __at 0x5a91 SPI2CON2CLR;
__sfr __banked __at 0x5a92 SPI2CON2SET;
__sfr __banked __at 0x5a93 SPI2CON2INV;
__sfr __banked __at 0x6080 U1MODE;
__sfr __banked __at 0x6080 UDCMODE;
__sfr __banked __at 0x6081 U1MODECLR;
__sfr __banked __at 0x6081 UDCMODECLR;
__sfr __banked __at 0x6082 U1MODESET;
__sfr __banked __at 0x6082 UDCMODESET;
__sfr __banked __at 0x6083 U1MODEINV;
__sfr __banked __at 0x6083 UDCMODEINV;
__sfr __banked __at 0x6084 U1STA;
__sfr __banked __at 0x6084 UDCSTA;
__sfr __banked __at 0x6085 U1STACLR;
__sfr __banked __at 0x6085 UDCSTACLR;
__sfr __banked __at 0x6086 U1STASET;
__sfr __banked __at 0x6086 UDCSTASET;
__sfr __banked __at 0x6087 U1STAINV;
__sfr __banked __at 0x6087 UDCSTAINV;
__sfr __banked __at 0x6088 U1TXREG;
__sfr __banked __at 0x6088 UDCTXREG;
__sfr __banked __at 0x608c U1RXREG;
__sfr __banked __at 0x608c UDCRXREG;
__sfr __banked __at 0x6090 U1BRG;
__sfr __banked __at 0x6090 UDCBRG;
__sfr __banked __at 0x6091 U1BRGCLR;
__sfr __banked __at 0x6091 UDCBRGCLR;
__sfr __banked __at 0x6092 U1BRGSET;
__sfr __banked __at 0x6092 UDCBRGSET;
__sfr __banked __at 0x6093 U1BRGINV;
__sfr __banked __at 0x6093 UDCBRGINV;
__sfr __banked __at 0x6280 U2MODE;
__sfr __banked __at 0x6280 U8932MODE;
__sfr __banked __at 0x6281 U2MODECLR;
__sfr __banked __at 0x6281 U8932MODECLR;
__sfr __banked __at 0x6282 U2MODESET;
__sfr __banked __at 0x6282 U8932MODESET;
__sfr __banked __at 0x6283 U2MODEINV;
__sfr __banked __at 0x6283 U8932MODEINV;
__sfr __banked __at 0x6284 U2STA;
__sfr __banked __at 0x6284 U8932STA;
__sfr __banked __at 0x6285 U2STACLR;
__sfr __banked __at 0x6285 U8932STACLR;
__sfr __banked __at 0x6286 U2STASET;
__sfr __banked __at 0x6286 U8932STASET;
__sfr __banked __at 0x6287 U2STAINV;
__sfr __banked __at 0x6287 U8932STAINV;
__sfr __banked __at 0x6288 U2TXREG;
__sfr __banked __at 0x6288 U8932TXREG;
__sfr __banked __at 0x628c U2RXREG;
__sfr __banked __at 0x628c U8932RXREG;
__sfr __banked __at 0x6290 U2BRG;
__sfr __banked __at 0x6290 U8932BRG;
__sfr __banked __at 0x6291 U2BRGCLR;
__sfr __banked __at 0x6291 U8932BRGCLR;
__sfr __banked __at 0x6292 U2BRGSET;
__sfr __banked __at 0x6292 U8932BRGSET;
__sfr __banked __at 0x6293 U2BRGINV;
__sfr __banked __at 0x6293 U8932BRGINV;
__sfr __banked __at 0x6480 U3MODE;
__sfr __banked __at 0x6480 U39MODE;
__sfr __banked __at 0x6481 U3MODECLR;
__sfr __banked __at 0x6481 U39MODECLR;
__sfr __banked __at 0x6482 U3MODESET;
__sfr __banked __at 0x6482 U39MODESET;
__sfr __banked __at 0x6483 U3MODEINV;
__sfr __banked __at 0x6483 U39MODEINV;
__sfr __banked __at 0x6484 U3STA;
__sfr __banked __at 0x6484 U39STA;
__sfr __banked __at 0x6485 U3STACLR;
__sfr __banked __at 0x6485 U39STACLR;
__sfr __banked __at 0x6486 U3STASET;
__sfr __banked __at 0x6486 U39STASET;
__sfr __banked __at 0x6487 U3STAINV;
__sfr __banked __at 0x6487 U39STAINV;
__sfr __banked __at 0x6488 U3TXREG;
__sfr __banked __at 0x6488 U39TXREG;
__sfr __banked __at 0x648c U3RXREG;
__sfr __banked __at 0x648c U39RXREG;
__sfr __banked __at 0x6490 U3BRG;
__sfr __banked __at 0x6490 U39BRG;
__sfr __banked __at 0x6491 U3BRGCLR;
__sfr __banked __at 0x6491 U39BRGCLR;
__sfr __banked __at 0x6492 U3BRGSET;
__sfr __banked __at 0x6492 U39BRGSET;
__sfr __banked __at 0x6493 U3BRGINV;
__sfr __banked __at 0x6493 U39BRGINV;
__sfr __banked __at 0x6680 U4MODE;
__sfr __banked __at 0x6680 UodMODE;
__sfr __banked __at 0x6681 U4MODECLR;
__sfr __banked __at 0x6681 UodMODECLR;
__sfr __banked __at 0x6682 U4MODESET;
__sfr __banked __at 0x6682 UodMODESET;
__sfr __banked __at 0x6683 U4MODEINV;
__sfr __banked __at 0x6683 UodMODEINV;
__sfr __banked __at 0x6684 U4STA;
__sfr __banked __at 0x6684 UodSTA;
__sfr __banked __at 0x6685 U4STACLR;
__sfr __banked __at 0x6685 UodSTACLR;
__sfr __banked __at 0x6686 U4STASET;
__sfr __banked __at 0x6686 UodSTASET;
__sfr __banked __at 0x6687 U4STAINV;
__sfr __banked __at 0x6687 UodSTAINV;
__sfr __banked __at 0x6688 U4TXREG;
__sfr __banked __at 0x6688 UodTXREG;
__sfr __banked __at 0x668c U4RXREG;
__sfr __banked __at 0x668c UodRXREG;
__sfr __banked __at 0x6690 U4BRG;
__sfr __banked __at 0x6690 UodBRG;
__sfr __banked __at 0x6691 U4BRGCLR;
__sfr __banked __at 0x6691 UodBRGCLR;
__sfr __banked __at 0x6692 U4BRGSET;
__sfr __banked __at 0x6692 UodBRGSET;
__sfr __banked __at 0x6693 U4BRGINV;
__sfr __banked __at 0x6693 UodBRGINV;
__sfr __banked __at 0x7080 PMCON;
__sfr __banked __at 0x7081 PMCONCLR;
__sfr __banked __at 0x7082 PMCONSET;
__sfr __banked __at 0x7083 PMCONINV;
__sfr __banked __at 0x7084 PMMODE;
__sfr __banked __at 0x7085 PMMODECLR;
__sfr __banked __at 0x7086 PMMODESET;
__sfr __banked __at 0x7087 PMMODEINV;
__sfr __banked __at 0x7088 PMADDR;
__sfr __banked __at 0x7089 PMADDRCLR;
__sfr __banked __at 0x708a PMADDRSET;
__sfr __banked __at 0x708b PMADDRINV;
__sfr __banked __at 0x708c PMDOUT;
__sfr __banked __at 0x708d PMDOUTCLR;
__sfr __banked __at 0x708e PMDOUTSET;
__sfr __banked __at 0x708f PMDOUTINV;
__sfr __banked __at 0x7090 PMDIN;
__sfr __banked __at 0x7091 PMDINCLR;
__sfr __banked __at 0x7092 PMDINSET;
__sfr __banked __at 0x7093 PMDININV;
__sfr __banked __at 0x7094 PMAEN;
__sfr __banked __at 0x7095 PMAENCLR;
__sfr __banked __at 0x7096 PMAENSET;
__sfr __banked __at 0x7097 PMAENINV;
__sfr __banked __at 0x7098 PMSTAT;
__sfr __banked __at 0x7099 PMSTATCLR;
__sfr __banked __at 0x709a PMSTATSET;
__sfr __banked __at 0x709b PMSTATINV;
__sfr __banked __at 0x9080 AD1CON1;
__sfr __banked __at 0x9081 AD1CON1CLR;
__sfr __banked __at 0x9082 AD1CON1SET;
__sfr __banked __at 0x9083 AD1CON1INV;
__sfr __banked __at 0x9084 AD1CON2;
__sfr __banked __at 0x9085 AD1CON2CLR;
__sfr __banked __at 0x9086 AD1CON2SET;
__sfr __banked __at 0x9087 AD1CON2INV;
__sfr __banked __at 0x9088 AD1CON3;
__sfr __banked __at 0x9089 AD1CON3CLR;
__sfr __banked __at 0x908a AD1CON3SET;
__sfr __banked __at 0x908b AD1CON3INV;
__sfr __banked __at 0x9090 AD1CHS;
__sfr __banked __at 0x9091 AD1CHSCLR;
__sfr __banked __at 0x9092 AD1CHSSET;
__sfr __banked __at 0x9093 AD1CHSINV;
__sfr __banked __at 0x9094 AD1CSSL;
__sfr __banked __at 0x9095 AD1CSSLCLR;
__sfr __banked __at 0x9096 AD1CSSLSET;
__sfr __banked __at 0x9097 AD1CSSLINV;
__sfr __banked __at 0x909c ADC1BUF0;
__sfr __banked __at 0x90a0 ADC1BUF1;
__sfr __banked __at 0x90a4 ADC1BUF2;
__sfr __banked __at 0x90a8 ADC1BUF3;
__sfr __banked __at 0x90ac ADC1BUF4;
__sfr __banked __at 0x90b0 ADC1BUF5;
__sfr __banked __at 0x90b4 ADC1BUF6;
__sfr __banked __at 0x90b8 ADC1BUF7;
__sfr __banked __at 0x90bc ADC1BUF8;
__sfr __banked __at 0x9180 ADC1BUF9;
__sfr __banked __at 0x9184 ADC1BUFA;
__sfr __banked __at 0x9188 ADC1BUFB;
__sfr __banked __at 0x918c ADC1BUFC;
__sfr __banked __at 0x9190 ADC1BUFD;
__sfr __banked __at 0x9194 ADC1BUFE;
__sfr __banked __at 0x9198 ADC1BUFF;
__sfr __banked __at 0x9880 CVRCON;
__sfr __banked __at 0x9881 CVRCONCLR;
__sfr __banked __at 0x9882 CVRCONSET;
__sfr __banked __at 0x9883 CVRCONINV;
__sfr __banked __at 0xa080 CM1CON;
__sfr __banked __at 0xa081 CM1CONCLR;
__sfr __banked __at 0xa082 CM1CONSET;
__sfr __banked __at 0xa083 CM1CONINV;
__sfr __banked __at 0xa084 CM2CON;
__sfr __banked __at 0xa085 CM2CONCLR;
__sfr __banked __at 0xa086 CM2CONSET;
__sfr __banked __at 0xa087 CM2CONINV;
__sfr __banked __at 0xa098 CMSTAT;
__sfr __banked __at 0xa099 CMSTATCLR;
__sfr __banked __at 0xa09a CMSTATSET;
__sfr __banked __at 0xa09b CMSTATINV;
__sfr __banked __at 0xa280 CTMUCON;
__sfr __banked __at 0xa281 CTMUCONCLR;
__sfr __banked __at 0xa282 CTMUCONSET;
__sfr __banked __at 0xa283 CTMUCONINV;
__sfr __banked __at 0xf080 OSCCON;
__sfr __banked __at 0xf081 OSCCONCLR;
__sfr __banked __at 0xf082 OSCCONSET;
__sfr __banked __at 0xf083 OSCCONINV;
__sfr __banked __at 0xf084 OSCTUN;
__sfr __banked __at 0xf085 OSCTUNCLR;
__sfr __banked __at 0xf086 OSCTUNSET;
__sfr __banked __at 0xf087 OSCTUNINV;
__sfr __banked __at 0xf088 REFOCON;
__sfr __banked __at 0xf089 REFOCONCLR;
__sfr __banked __at 0xf08a REFOCONSET;
__sfr __banked __at 0xf08b REFOCONINV;
__sfr __banked __at 0xf08c REFOTRIM;
__sfr __banked __at 0xf08d REFOTRIMCLR;
__sfr __banked __at 0xf08e REFOTRIMSET;
__sfr __banked __at 0xf08f REFOTRIMINV;
__sfr __banked __at 0xf280 CFGCON;
__sfr __banked __at 0xf280 DDPCON;
__sfr __banked __at 0xf288 DEVID;
__sfr __banked __at 0xf28c SYSKEY;
__sfr __banked __at 0xf28d SYSKEYCLR;
__sfr __banked __at 0xf28e SYSKEYSET;
__sfr __banked __at 0xf28f SYSKEYINV;
__sfr __banked __at 0xf290 PMD1;
__sfr __banked __at 0xf291 PMD1CLR;
__sfr __banked __at 0xf292 PMD1SET;
__sfr __banked __at 0xf293 PMD1INV;
__sfr __banked __at 0xf294 PMD2;
__sfr __banked __at 0xf295 PMD2CLR;
__sfr __banked __at 0xf296 PMD2SET;
__sfr __banked __at 0xf297 PMD2INV;
__sfr __banked __at 0xf298 PMD3;
__sfr __banked __at 0xf299 PMD3CLR;
__sfr __banked __at 0xf29a PMD3SET;
__sfr __banked __at 0xf29b PMD3INV;
__sfr __banked __at 0xf29c PMD4;
__sfr __banked __at 0xf29d PMD4CLR;
__sfr __banked __at 0xf29e PMD4SET;
__sfr __banked __at 0xf29f PMD4INV;
__sfr __banked __at 0xf2a0 PMD5;
__sfr __banked __at 0xf2a1 PMD5CLR;
__sfr __banked __at 0xf2a2 PMD5SET;
__sfr __banked __at 0xf2a3 PMD5INV;
__sfr __banked __at 0xf2a4 PMD6;
__sfr __banked __at 0xf2a5 PMD6CLR;
__sfr __banked __at 0xf2a6 PMD6SET;
__sfr __banked __at 0xf2a7 PMD6INV;
__sfr __banked __at 0xf480 NVMCON;
__sfr __banked __at 0xf481 NVMCONCLR;
__sfr __banked __at 0xf482 NVMCONSET;
__sfr __banked __at 0xf483 NVMCONINV;
__sfr __banked __at 0xf484 NVMKEY;
__sfr __banked __at 0xf488 NVMADDR;
__sfr __banked __at 0xf489 NVMADDRCLR;
__sfr __banked __at 0xf48a NVMADDRSET;
__sfr __banked __at 0xf48b NVMADDRINV;
__sfr __banked __at 0xf48c NVMDATA;
__sfr __banked __at 0xf490 NVMSRCADDR;
__sfr __banked __at 0xf680 RCON;
__sfr __banked __at 0xf681 RCONCLR;
__sfr __banked __at 0xf682 RCONSET;
__sfr __banked __at 0xf683 RCONINV;
__sfr __banked __at 0xf684 RSWRST;
__sfr __banked __at 0xf685 RSWRSTCLR;
__sfr __banked __at 0xf686 RSWRSTSET;
__sfr __banked __at 0xf687 RSWRSTINV;
__sfr __banked __at 0xfa81 INT1R;
__sfr __banked __at 0xfa82 INT2R;
__sfr __banked __at 0xfa83 INT3R;
__sfr __banked __at 0xfa84 INT4R;
__sfr __banked __at 0xfa86 T2CKR;
__sfr __banked __at 0xfa87 T3CKR;
__sfr __banked __at 0xfa88 T4CKR;
__sfr __banked __at 0xfa89 T5CKR;
__sfr __banked __at 0xfa8a IC1R;
__sfr __banked __at 0xfa8b IC2R;
__sfr __banked __at 0xfa8c IC3R;
__sfr __banked __at 0xfa8d IC4R;
__sfr __banked __at 0xfa8e IC5R;
