kmorimatsu/fuzixapps/fzkmmega/p32mx370f.h
__sfr __banked __at 0xfa92 OCFAR;
__sfr __banked __at 0xfa94 U1RXR;
__sfr __banked __at 0xfa95 U1CTSR;
__sfr __banked __at 0xfa96 U2RXR;
__sfr __banked __at 0xfa97 U2CTSR;
__sfr __banked __at 0xfa98 U3RXR;
__sfr __banked __at 0xfa99 U3CTSR;
__sfr __banked __at 0xfa9a U4RXR;
__sfr __banked __at 0xfa9b U4CTSR;
__sfr __banked __at 0xfa9c U5RXR;
__sfr __banked __at 0xfa9d U5CTSR;
__sfr __banked __at 0xfaa1 SDI1R;
__sfr __banked __at 0xfaa2 SS1R;
__sfr __banked __at 0xfaa4 SDI2R;
__sfr __banked __at 0xfaa5 SS2R;
__sfr __banked __at 0xfab4 REFCLKIR;
__sfr __banked __at 0xfb90 RPB0R;
__sfr __banked __at 0xfb91 RPB1R;
__sfr __banked __at 0xfb92 RPB2R;
__sfr __banked __at 0xfb93 RPB3R;
__sfr __banked __at 0xfb95 RPB5R;
__sfr __banked __at 0xfb96 RPB6R;
__sfr __banked __at 0xfb97 RPB7R;
__sfr __banked __at 0xfb98 RPB8R;
__sfr __banked __at 0xfb99 RPB9R;
__sfr __banked __at 0xfb9a RPB10R;
__sfr __banked __at 0xfb9e RPB14R;
__sfr __banked __at 0xfb9f RPB15R;
__sfr __banked __at 0xfbad RPC13R;
__sfr __banked __at 0xfbae RPC14R;
__sfr __banked __at 0xfbb0 RPD0R;
__sfr __banked __at 0xfbb1 RPD1R;
__sfr __banked __at 0xfbb2 RPD2R;
__sfr __banked __at 0xfbb3 RPD3R;
__sfr __banked __at 0xfbb4 RPD4R;
__sfr __banked __at 0xfbb5 RPD5R;
__sfr __banked __at 0xfbb8 RPD8R;
__sfr __banked __at 0xfbb9 RPD9R;
__sfr __banked __at 0xfbba RPD10R;
__sfr __banked __at 0xfbbb RPD11R;
__sfr __banked __at 0xfc83 RPE3R;
__sfr __banked __at 0xfc85 RPE5R;
__sfr __banked __at 0xfc90 RPF0R;
__sfr __banked __at 0xfc91 RPF1R;
__sfr __banked __at 0xfc92 RPF2R;
__sfr __banked __at 0xfc93 RPF3R;
__sfr __banked __at 0xfc94 RPF4R;
__sfr __banked __at 0xfc95 RPF5R;
__sfr __banked __at 0xfc96 RPF6R;
__sfr __banked __at 0xfca6 RPG6R;
__sfr __banked __at 0xfca7 RPG7R;
__sfr __banked __at 0xfca8 RPG8R;
__sfr __banked __at 0xfca9 RPG9R;
__sfr __banked __at 0x10c0 INTCON;
__sfr __banked __at 0x10c1 INTCONCLR;
__sfr __banked __at 0x10c2 INTCONSET;
__sfr __banked __at 0x10c3 INTCONINV;
__sfr __banked __at 0x10c4 INTSTAT;
__sfr __banked __at 0x10c8 IPTMR;
__sfr __banked __at 0x10c9 IPTMRCLR;
__sfr __banked __at 0x10ca IPTMRSET;
__sfr __banked __at 0x10cb IPTMRINV;
__sfr __banked __at 0x10cc IFS0;
__sfr __banked __at 0x10cd IFS0CLR;
__sfr __banked __at 0x10ce IFS0SET;
__sfr __banked __at 0x10cf IFS0INV;
__sfr __banked __at 0x10d0 IFS1;
__sfr __banked __at 0x10d1 IFS1CLR;
__sfr __banked __at 0x10d2 IFS1SET;
__sfr __banked __at 0x10d3 IFS1INV;
__sfr __banked __at 0x10d4 IFS2;
__sfr __banked __at 0x10d5 IFS2CLR;
__sfr __banked __at 0x10d6 IFS2SET;
__sfr __banked __at 0x10d7 IFS2INV;
__sfr __banked __at 0x10d8 IEC0;
__sfr __banked __at 0x10d9 IEC0CLR;
__sfr __banked __at 0x10da IEC0SET;
__sfr __banked __at 0x10db IEC0INV;
__sfr __banked __at 0x10dc IEC1;
__sfr __banked __at 0x10dd IEC1CLR;
__sfr __banked __at 0x10de IEC1SET;
__sfr __banked __at 0x10df IEC1INV;
__sfr __banked __at 0x10e0 IEC2;
__sfr __banked __at 0x10e1 IEC2CLR;
__sfr __banked __at 0x10e2 IEC2SET;
__sfr __banked __at 0x10e3 IEC2INV;
__sfr __banked __at 0x10e4 IPC0;
__sfr __banked __at 0x10e5 IPC0CLR;
__sfr __banked __at 0x10e6 IPC0SET;
__sfr __banked __at 0x10e7 IPC0INV;
__sfr __banked __at 0x10e8 IPC1;
__sfr __banked __at 0x10e9 IPC1CLR;
__sfr __banked __at 0x10ea IPC1SET;
__sfr __banked __at 0x10eb IPC1INV;
__sfr __banked __at 0x10ec IPC2;
__sfr __banked __at 0x10ed IPC2CLR;
__sfr __banked __at 0x10ee IPC2SET;
__sfr __banked __at 0x10ef IPC2INV;
__sfr __banked __at 0x10f0 IPC3;
__sfr __banked __at 0x10f1 IPC3CLR;
__sfr __banked __at 0x10f2 IPC3SET;
__sfr __banked __at 0x10f3 IPC3INV;
__sfr __banked __at 0x10f4 IPC4;
__sfr __banked __at 0x10f5 IPC4CLR;
__sfr __banked __at 0x10f6 IPC4SET;
__sfr __banked __at 0x10f7 IPC4INV;
__sfr __banked __at 0x10f8 IPC5;
__sfr __banked __at 0x10f9 IPC5CLR;
__sfr __banked __at 0x10fa IPC5SET;
__sfr __banked __at 0x10fb IPC5INV;
__sfr __banked __at 0x10fc IPC6;
__sfr __banked __at 0x10fd IPC6CLR;
__sfr __banked __at 0x10fe IPC6SET;
__sfr __banked __at 0x10ff IPC6INV;
__sfr __banked __at 0x11c0 IPC7;
__sfr __banked __at 0x11c1 IPC7CLR;
__sfr __banked __at 0x11c2 IPC7SET;
__sfr __banked __at 0x11c3 IPC7INV;
__sfr __banked __at 0x11c4 IPC8;
__sfr __banked __at 0x11c5 IPC8CLR;
__sfr __banked __at 0x11c6 IPC8SET;
__sfr __banked __at 0x11c7 IPC8INV;
__sfr __banked __at 0x11c8 IPC9;
__sfr __banked __at 0x11c9 IPC9CLR;
__sfr __banked __at 0x11ca IPC9SET;
__sfr __banked __at 0x11cb IPC9INV;
__sfr __banked __at 0x11cc IPC10;
__sfr __banked __at 0x11cd IPC10CLR;
__sfr __banked __at 0x11ce IPC10SET;
__sfr __banked __at 0x11cf IPC10INV;
__sfr __banked __at 0x11d0 IPC11;
__sfr __banked __at 0x11d1 IPC11CLR;
__sfr __banked __at 0x11d2 IPC11SET;
__sfr __banked __at 0x11d3 IPC11INV;
__sfr __banked __at 0x20c0 BMXCON;
__sfr __banked __at 0x20c1 BMXCONCLR;
__sfr __banked __at 0x20c2 BMXCONSET;
__sfr __banked __at 0x20c3 BMXCONINV;
__sfr __banked __at 0x20c4 BMXDKPBA;
__sfr __banked __at 0x20c5 BMXDKPBACLR;
__sfr __banked __at 0x20c6 BMXDKPBASET;
__sfr __banked __at 0x20c7 BMXDKPBAINV;
__sfr __banked __at 0x20c8 BMXDUDBA;
__sfr __banked __at 0x20c9 BMXDUDBACLR;
__sfr __banked __at 0x20ca BMXDUDBASET;
__sfr __banked __at 0x20cb BMXDUDBAINV;
__sfr __banked __at 0x20cc BMXDUPBA;
__sfr __banked __at 0x20cd BMXDUPBACLR;
__sfr __banked __at 0x20ce BMXDUPBASET;
__sfr __banked __at 0x20cf BMXDUPBAINV;
__sfr __banked __at 0x20d0 BMXDRMSZ;
__sfr __banked __at 0x20d4 BMXPUPBA;
__sfr __banked __at 0x20d5 BMXPUPBACLR;
__sfr __banked __at 0x20d6 BMXPUPBASET;
__sfr __banked __at 0x20d7 BMXPUPBAINV;
__sfr __banked __at 0x20d8 BMXPFMSZ;
__sfr __banked __at 0x20dc BMXBOOTSZ;
__sfr __banked __at 0x30c0 DMACON;
__sfr __banked __at 0x30c1 DMACONCLR;
__sfr __banked __at 0x30c2 DMACONSET;
__sfr __banked __at 0x30c3 DMACONINV;
__sfr __banked __at 0x30c4 DMASTAT;
__sfr __banked __at 0x30c5 DMASTATCLR;
__sfr __banked __at 0x30c6 DMASTATSET;
__sfr __banked __at 0x30c7 DMASTATINV;
__sfr __banked __at 0x30c8 DMAADDR;
__sfr __banked __at 0x30c9 DMAADDRCLR;
__sfr __banked __at 0x30ca DMAADDRSET;
__sfr __banked __at 0x30cb DMAADDRINV;
__sfr __banked __at 0x30cc DCRCCON;
__sfr __banked __at 0x30cd DCRCCONCLR;
__sfr __banked __at 0x30ce DCRCCONSET;
__sfr __banked __at 0x30cf DCRCCONINV;
__sfr __banked __at 0x30d0 DCRCDATA;
__sfr __banked __at 0x30d1 DCRCDATACLR;
__sfr __banked __at 0x30d2 DCRCDATASET;
__sfr __banked __at 0x30d3 DCRCDATAINV;
__sfr __banked __at 0x30d4 DCRCXOR;
__sfr __banked __at 0x30d5 DCRCXORCLR;
__sfr __banked __at 0x30d6 DCRCXORSET;
__sfr __banked __at 0x30d7 DCRCXORINV;
__sfr __banked __at 0x30d8 DCH0CON;
__sfr __banked __at 0x30d9 DCH0CONCLR;
__sfr __banked __at 0x30da DCH0CONSET;
__sfr __banked __at 0x30db DCH0CONINV;
__sfr __banked __at 0x30dc DCH0ECON;
__sfr __banked __at 0x30dd DCH0ECONCLR;
__sfr __banked __at 0x30de DCH0ECONSET;
__sfr __banked __at 0x30df DCH0ECONINV;
__sfr __banked __at 0x30e0 DCH0INT;
__sfr __banked __at 0x30e1 DCH0INTCLR;
__sfr __banked __at 0x30e2 DCH0INTSET;
__sfr __banked __at 0x30e3 DCH0INTINV;
__sfr __banked __at 0x30e4 DCH0SSA;
__sfr __banked __at 0x30e5 DCH0SSACLR;
__sfr __banked __at 0x30e6 DCH0SSASET;
__sfr __banked __at 0x30e7 DCH0SSAINV;
__sfr __banked __at 0x30e8 DCH0DSA;
__sfr __banked __at 0x30e9 DCH0DSACLR;
__sfr __banked __at 0x30ea DCH0DSASET;
__sfr __banked __at 0x30eb DCH0DSAINV;
__sfr __banked __at 0x30ec DCH0SSIZ;
__sfr __banked __at 0x30ed DCH0SSIZCLR;
__sfr __banked __at 0x30ee DCH0SSIZSET;
__sfr __banked __at 0x30ef DCH0SSIZINV;
__sfr __banked __at 0x30f0 DCH0DSIZ;
__sfr __banked __at 0x30f1 DCH0DSIZCLR;
__sfr __banked __at 0x30f2 DCH0DSIZSET;
__sfr __banked __at 0x30f3 DCH0DSIZINV;
__sfr __banked __at 0x30f4 DCH0SPTR;
__sfr __banked __at 0x30f5 DCH0SPTRCLR;
__sfr __banked __at 0x30f6 DCH0SPTRSET;
__sfr __banked __at 0x30f7 DCH0SPTRINV;
__sfr __banked __at 0x30f8 DCH0DPTR;
__sfr __banked __at 0x30f9 DCH0DPTRCLR;
__sfr __banked __at 0x30fa DCH0DPTRSET;
__sfr __banked __at 0x30fb DCH0DPTRINV;
__sfr __banked __at 0x30fc DCH0CSIZ;
__sfr __banked __at 0x30fd DCH0CSIZCLR;
__sfr __banked __at 0x30fe DCH0CSIZSET;
__sfr __banked __at 0x30ff DCH0CSIZINV;
__sfr __banked __at 0x31c0 DCH0CPTR;
__sfr __banked __at 0x31c1 DCH0CPTRCLR;
__sfr __banked __at 0x31c2 DCH0CPTRSET;
__sfr __banked __at 0x31c3 DCH0CPTRINV;
__sfr __banked __at 0x31c4 DCH0DAT;
__sfr __banked __at 0x31c5 DCH0DATCLR;
__sfr __banked __at 0x31c6 DCH0DATSET;
__sfr __banked __at 0x31c7 DCH0DATINV;
__sfr __banked __at 0x31c8 DCH1CON;
__sfr __banked __at 0x31c9 DCH1CONCLR;
__sfr __banked __at 0x31ca DCH1CONSET;
__sfr __banked __at 0x31cb DCH1CONINV;
__sfr __banked __at 0x31cc DCH1ECON;
__sfr __banked __at 0x31cd DCH1ECONCLR;
__sfr __banked __at 0x31ce DCH1ECONSET;
__sfr __banked __at 0x31cf DCH1ECONINV;
__sfr __banked __at 0x31d0 DCH1INT;
__sfr __banked __at 0x31d1 DCH1INTCLR;
__sfr __banked __at 0x31d2 DCH1INTSET;
__sfr __banked __at 0x31d3 DCH1INTINV;
__sfr __banked __at 0x31d4 DCH1SSA;
__sfr __banked __at 0x31d5 DCH1SSACLR;
__sfr __banked __at 0x31d6 DCH1SSASET;
__sfr __banked __at 0x31d7 DCH1SSAINV;
__sfr __banked __at 0x31d8 DCH1DSA;
__sfr __banked __at 0x31d9 DCH1DSACLR;
__sfr __banked __at 0x31da DCH1DSASET;
__sfr __banked __at 0x31db DCH1DSAINV;
__sfr __banked __at 0x31dc DCH1SSIZ;
__sfr __banked __at 0x31dd DCH1SSIZCLR;
__sfr __banked __at 0x31de DCH1SSIZSET;
__sfr __banked __at 0x31df DCH1SSIZINV;
__sfr __banked __at 0x31e0 DCH1DSIZ;
__sfr __banked __at 0x31e1 DCH1DSIZCLR;
__sfr __banked __at 0x31e2 DCH1DSIZSET;
__sfr __banked __at 0x31e3 DCH1DSIZINV;
__sfr __banked __at 0x31e4 DCH1SPTR;
__sfr __banked __at 0x31e5 DCH1SPTRCLR;
__sfr __banked __at 0x31e6 DCH1SPTRSET;
__sfr __banked __at 0x31e7 DCH1SPTRINV;
__sfr __banked __at 0x31e8 DCH1DPTR;
__sfr __banked __at 0x31e9 DCH1DPTRCLR;
__sfr __banked __at 0x31ea DCH1DPTRSET;
__sfr __banked __at 0x31eb DCH1DPTRINV;
__sfr __banked __at 0x31ec DCH1CSIZ;
__sfr __banked __at 0x31ed DCH1CSIZCLR;
__sfr __banked __at 0x31ee DCH1CSIZSET;
__sfr __banked __at 0x31ef DCH1CSIZINV;
__sfr __banked __at 0x31f0 DCH1CPTR;
__sfr __banked __at 0x31f1 DCH1CPTRCLR;
__sfr __banked __at 0x31f2 DCH1CPTRSET;
__sfr __banked __at 0x31f3 DCH1CPTRINV;
__sfr __banked __at 0x31f4 DCH1DAT;
__sfr __banked __at 0x31f5 DCH1DATCLR;
__sfr __banked __at 0x31f6 DCH1DATSET;
__sfr __banked __at 0x31f7 DCH1DATINV;
__sfr __banked __at 0x31f8 DCH2CON;
__sfr __banked __at 0x31f9 DCH2CONCLR;
__sfr __banked __at 0x31fa DCH2CONSET;
__sfr __banked __at 0x31fb DCH2CONINV;
__sfr __banked __at 0x31fc DCH2ECON;
__sfr __banked __at 0x31fd DCH2ECONCLR;
__sfr __banked __at 0x31fe DCH2ECONSET;
__sfr __banked __at 0x31ff DCH2ECONINV;
__sfr __banked __at 0x32c0 DCH2INT;
__sfr __banked __at 0x32c1 DCH2INTCLR;
__sfr __banked __at 0x32c2 DCH2INTSET;
__sfr __banked __at 0x32c3 DCH2INTINV;
__sfr __banked __at 0x32c4 DCH2SSA;
__sfr __banked __at 0x32c5 DCH2SSACLR;
__sfr __banked __at 0x32c6 DCH2SSASET;
__sfr __banked __at 0x32c7 DCH2SSAINV;
__sfr __banked __at 0x32c8 DCH2DSA;
__sfr __banked __at 0x32c9 DCH2DSACLR;
__sfr __banked __at 0x32ca DCH2DSASET;
__sfr __banked __at 0x32cb DCH2DSAINV;
__sfr __banked __at 0x32cc DCH2SSIZ;
__sfr __banked __at 0x32cd DCH2SSIZCLR;
__sfr __banked __at 0x32ce DCH2SSIZSET;
__sfr __banked __at 0x32cf DCH2SSIZINV;
__sfr __banked __at 0x32d0 DCH2DSIZ;
__sfr __banked __at 0x32d1 DCH2DSIZCLR;
__sfr __banked __at 0x32d2 DCH2DSIZSET;
__sfr __banked __at 0x32d3 DCH2DSIZINV;
__sfr __banked __at 0x32d4 DCH2SPTR;
__sfr __banked __at 0x32d5 DCH2SPTRCLR;
__sfr __banked __at 0x32d6 DCH2SPTRSET;
__sfr __banked __at 0x32d7 DCH2SPTRINV;
__sfr __banked __at 0x32d8 DCH2DPTR;
__sfr __banked __at 0x32d9 DCH2DPTRCLR;
__sfr __banked __at 0x32da DCH2DPTRSET;
__sfr __banked __at 0x32db DCH2DPTRINV;
__sfr __banked __at 0x32dc DCH2CSIZ;
__sfr __banked __at 0x32dd DCH2CSIZCLR;
__sfr __banked __at 0x32de DCH2CSIZSET;
__sfr __banked __at 0x32df DCH2CSIZINV;
__sfr __banked __at 0x32e0 DCH2CPTR;
__sfr __banked __at 0x32e1 DCH2CPTRCLR;
__sfr __banked __at 0x32e2 DCH2CPTRSET;
__sfr __banked __at 0x32e3 DCH2CPTRINV;
__sfr __banked __at 0x32e4 DCH2DAT;
__sfr __banked __at 0x32e5 DCH2DATCLR;
__sfr __banked __at 0x32e6 DCH2DATSET;
__sfr __banked __at 0x32e7 DCH2DATINV;
__sfr __banked __at 0x32e8 DCH3CON;
__sfr __banked __at 0x32e9 DCH3CONCLR;
__sfr __banked __at 0x32ea DCH3CONSET;
__sfr __banked __at 0x32eb DCH3CONINV;
__sfr __banked __at 0x32ec DCH3ECON;
__sfr __banked __at 0x32ed DCH3ECONCLR;
__sfr __banked __at 0x32ee DCH3ECONSET;
__sfr __banked __at 0x32ef DCH3ECONINV;
__sfr __banked __at 0x32f0 DCH3INT;
__sfr __banked __at 0x32f1 DCH3INTCLR;
__sfr __banked __at 0x32f2 DCH3INTSET;
__sfr __banked __at 0x32f3 DCH3INTINV;
__sfr __banked __at 0x32f4 DCH3SSA;
__sfr __banked __at 0x32f5 DCH3SSACLR;
__sfr __banked __at 0x32f6 DCH3SSASET;
__sfr __banked __at 0x32f7 DCH3SSAINV;
__sfr __banked __at 0x32f8 DCH3DSA;
__sfr __banked __at 0x32f9 DCH3DSACLR;
__sfr __banked __at 0x32fa DCH3DSASET;
__sfr __banked __at 0x32fb DCH3DSAINV;
__sfr __banked __at 0x32fc DCH3SSIZ;
__sfr __banked __at 0x32fd DCH3SSIZCLR;
__sfr __banked __at 0x32fe DCH3SSIZSET;
__sfr __banked __at 0x32ff DCH3SSIZINV;
__sfr __banked __at 0x33c0 DCH3DSIZ;
__sfr __banked __at 0x33c1 DCH3DSIZCLR;
__sfr __banked __at 0x33c2 DCH3DSIZSET;
__sfr __banked __at 0x33c3 DCH3DSIZINV;
__sfr __banked __at 0x33c4 DCH3SPTR;
__sfr __banked __at 0x33c5 DCH3SPTRCLR;
__sfr __banked __at 0x33c6 DCH3SPTRSET;
__sfr __banked __at 0x33c7 DCH3SPTRINV;
__sfr __banked __at 0x33c8 DCH3DPTR;
__sfr __banked __at 0x33c9 DCH3DPTRCLR;
__sfr __banked __at 0x33ca DCH3DPTRSET;
__sfr __banked __at 0x33cb DCH3DPTRINV;
__sfr __banked __at 0x33cc DCH3CSIZ;
__sfr __banked __at 0x33cd DCH3CSIZCLR;
__sfr __banked __at 0x33ce DCH3CSIZSET;
__sfr __banked __at 0x33cf DCH3CSIZINV;
__sfr __banked __at 0x33d0 DCH3CPTR;
__sfr __banked __at 0x33d1 DCH3CPTRCLR;
__sfr __banked __at 0x33d2 DCH3CPTRSET;
__sfr __banked __at 0x33d3 DCH3CPTRINV;
__sfr __banked __at 0x33d4 DCH3DAT;
__sfr __banked __at 0x33d5 DCH3DATCLR;
__sfr __banked __at 0x33d6 DCH3DATSET;
__sfr __banked __at 0x33d7 DCH3DATINV;
__sfr __banked __at 0x40c0 CHECON;
__sfr __banked __at 0x40c1 CHECONCLR;
__sfr __banked __at 0x40c2 CHECONSET;
__sfr __banked __at 0x40c3 CHECONINV;
__sfr __banked __at 0x40c4 CHEACC;
__sfr __banked __at 0x40c5 CHEACCCLR;
__sfr __banked __at 0x40c6 CHEACCSET;
__sfr __banked __at 0x40c7 CHEACCINV;
__sfr __banked __at 0x40c8 CHETAG;
__sfr __banked __at 0x40c9 CHETAGCLR;
__sfr __banked __at 0x40ca CHETAGSET;
__sfr __banked __at 0x40cb CHETAGINV;
__sfr __banked __at 0x40cc CHEMSK;
__sfr __banked __at 0x40cd CHEMSKCLR;
__sfr __banked __at 0x40ce CHEMSKSET;
__sfr __banked __at 0x40cf CHEMSKINV;
__sfr __banked __at 0x40d0 CHEW0;
__sfr __banked __at 0x40d4 CHEW1;
__sfr __banked __at 0x40d8 CHEW2;
__sfr __banked __at 0x40dc CHEW3;
__sfr __banked __at 0x40e0 CHELRU;
__sfr __banked __at 0x40e4 CHEHIT;
__sfr __banked __at 0x40e8 CHEMIS;
__sfr __banked __at 0x40ec RESERVED1;
__sfr __banked __at 0x40f0 CHEPFABT;
__sfr __banked __at 0x61c0 ANSELB;
__sfr __banked __at 0x61c1 ANSELBCLR;
__sfr __banked __at 0x61c2 ANSELBSET;
__sfr __banked __at 0x61c3 ANSELBINV;
__sfr __banked __at 0x61c4 TRISB;
__sfr __banked __at 0x61c5 TRISBCLR;
__sfr __banked __at 0x61c6 TRISBSET;
__sfr __banked __at 0x61c7 TRISBINV;
__sfr __banked __at 0x61c8 PORTB;
__sfr __banked __at 0x61c9 PORTBCLR;
__sfr __banked __at 0x61ca PORTBSET;
__sfr __banked __at 0x61cb PORTBINV;
__sfr __banked __at 0x61cc LATB;
__sfr __banked __at 0x61cd LATBCLR;
__sfr __banked __at 0x61ce LATBSET;
__sfr __banked __at 0x61cf LATBINV;
__sfr __banked __at 0x61d0 ODCB;
__sfr __banked __at 0x61d1 ODCBCLR;
__sfr __banked __at 0x61d2 ODCBSET;
__sfr __banked __at 0x61d3 ODCBINV;
__sfr __banked __at 0x61d4 CNPUB;
__sfr __banked __at 0x61d5 CNPUBCLR;
__sfr __banked __at 0x61d6 CNPUBSET;
__sfr __banked __at 0x61d7 CNPUBINV;
__sfr __banked __at 0x61d8 CNPDB;
__sfr __banked __at 0x61d9 CNPDBCLR;
__sfr __banked __at 0x61da CNPDBSET;
__sfr __banked __at 0x61db CNPDBINV;
__sfr __banked __at 0x61dc CNCONB;
__sfr __banked __at 0x61dd CNCONBCLR;
__sfr __banked __at 0x61de CNCONBSET;
__sfr __banked __at 0x61df CNCONBINV;
__sfr __banked __at 0x61e0 CNENB;
__sfr __banked __at 0x61e1 CNENBCLR;
__sfr __banked __at 0x61e2 CNENBSET;
__sfr __banked __at 0x61e3 CNENBINV;
__sfr __banked __at 0x61e4 CNSTATB;
__sfr __banked __at 0x61e5 CNSTATBCLR;
__sfr __banked __at 0x61e6 CNSTATBSET;
__sfr __banked __at 0x61e7 CNSTATBINV;
__sfr __banked __at 0x62c0 ANSELC;
__sfr __banked __at 0x62c1 ANSELCCLR;
__sfr __banked __at 0x62c2 ANSELCSET;
__sfr __banked __at 0x62c3 ANSELCINV;
__sfr __banked __at 0x62c4 TRISC;
__sfr __banked __at 0x62c5 TRISCCLR;
__sfr __banked __at 0x62c6 TRISCSET;
__sfr __banked __at 0x62c7 TRISCINV;
__sfr __banked __at 0x62c8 PORTC;
__sfr __banked __at 0x62c9 PORTCCLR;
__sfr __banked __at 0x62ca PORTCSET;
__sfr __banked __at 0x62cb PORTCINV;
__sfr __banked __at 0x62cc LATC;
__sfr __banked __at 0x62cd LATCCLR;
__sfr __banked __at 0x62ce LATCSET;
__sfr __banked __at 0x62cf LATCINV;
__sfr __banked __at 0x62d0 ODCC;
__sfr __banked __at 0x62d1 ODCCCLR;
__sfr __banked __at 0x62d2 ODCCSET;
__sfr __banked __at 0x62d3 ODCCINV;
__sfr __banked __at 0x62d4 CNPUC;
__sfr __banked __at 0x62d5 CNPUCCLR;
__sfr __banked __at 0x62d6 CNPUCSET;
__sfr __banked __at 0x62d7 CNPUCINV;
__sfr __banked __at 0x62d8 CNPDC;
__sfr __banked __at 0x62d9 CNPDCCLR;
__sfr __banked __at 0x62da CNPDCSET;
__sfr __banked __at 0x62db CNPDCINV;
__sfr __banked __at 0x62dc CNCONC;
__sfr __banked __at 0x62dd CNCONCCLR;
__sfr __banked __at 0x62de CNCONCSET;
__sfr __banked __at 0x62df CNCONCINV;
__sfr __banked __at 0x62e0 CNENC;
__sfr __banked __at 0x62e1 CNENCCLR;
__sfr __banked __at 0x62e2 CNENCSET;
__sfr __banked __at 0x62e3 CNENCINV;
__sfr __banked __at 0x62e4 CNSTATC;
__sfr __banked __at 0x62e5 CNSTATCCLR;
__sfr __banked __at 0x62e6 CNSTATCSET;
__sfr __banked __at 0x62e7 CNSTATCINV;
__sfr __banked __at 0x63c0 ANSELD;
__sfr __banked __at 0x63c1 ANSELDCLR;
__sfr __banked __at 0x63c2 ANSELDSET;
__sfr __banked __at 0x63c3 ANSELDINV;
__sfr __banked __at 0x63c4 TRISD;
__sfr __banked __at 0x63c5 TRISDCLR;
__sfr __banked __at 0x63c6 TRISDSET;
__sfr __banked __at 0x63c7 TRISDINV;
__sfr __banked __at 0x63c8 PORTD;
__sfr __banked __at 0x63c9 PORTDCLR;
__sfr __banked __at 0x63ca PORTDSET;
__sfr __banked __at 0x63cb PORTDINV;
__sfr __banked __at 0x63cc LATD;
__sfr __banked __at 0x63cd LATDCLR;
__sfr __banked __at 0x63ce LATDSET;
__sfr __banked __at 0x63cf LATDINV;
__sfr __banked __at 0x63d0 ODCD;
__sfr __banked __at 0x63d1 ODCDCLR;
__sfr __banked __at 0x63d2 ODCDSET;
__sfr __banked __at 0x63d3 ODCDINV;
__sfr __banked __at 0x63d4 CNPUD;
__sfr __banked __at 0x63d5 CNPUDCLR;
__sfr __banked __at 0x63d6 CNPUDSET;
__sfr __banked __at 0x63d7 CNPUDINV;
__sfr __banked __at 0x63d8 CNPDD;
__sfr __banked __at 0x63d9 CNPDDCLR;
__sfr __banked __at 0x63da CNPDDSET;
__sfr __banked __at 0x63db CNPDDINV;
__sfr __banked __at 0x63dc CNCOND;
__sfr __banked __at 0x63dd CNCONDCLR;
__sfr __banked __at 0x63de CNCONDSET;
__sfr __banked __at 0x63df CNCONDINV;
__sfr __banked __at 0x63e0 CNEND;
__sfr __banked __at 0x63e1 CNENDCLR;
__sfr __banked __at 0x63e2 CNENDSET;
__sfr __banked __at 0x63e3 CNENDINV;
__sfr __banked __at 0x63e4 CNSTATD;
__sfr __banked __at 0x63e5 CNSTATDCLR;
__sfr __banked __at 0x63e6 CNSTATDSET;
__sfr __banked __at 0x63e7 CNSTATDINV;
__sfr __banked __at 0x64c0 ANSELE;
__sfr __banked __at 0x64c1 ANSELECLR;
__sfr __banked __at 0x64c2 ANSELESET;
__sfr __banked __at 0x64c3 ANSELEINV;
__sfr __banked __at 0x64c4 TRISE;
__sfr __banked __at 0x64c5 TRISECLR;
__sfr __banked __at 0x64c6 TRISESET;
__sfr __banked __at 0x64c7 TRISEINV;
__sfr __banked __at 0x64c8 PORTE;
__sfr __banked __at 0x64c9 PORTECLR;
__sfr __banked __at 0x64ca PORTESET;
__sfr __banked __at 0x64cb PORTEINV;
__sfr __banked __at 0x64cc LATE;
__sfr __banked __at 0x64cd LATECLR;
__sfr __banked __at 0x64ce LATESET;
__sfr __banked __at 0x64cf LATEINV;
__sfr __banked __at 0x64d0 ODCE;
__sfr __banked __at 0x64d1 ODCECLR;
__sfr __banked __at 0x64d2 ODCESET;
__sfr __banked __at 0x64d3 ODCEINV;
__sfr __banked __at 0x64d4 CNPUE;
__sfr __banked __at 0x64d5 CNPUECLR;
__sfr __banked __at 0x64d6 CNPUESET;
__sfr __banked __at 0x64d7 CNPUEINV;
__sfr __banked __at 0x64d8 CNPDE;
__sfr __banked __at 0x64d9 CNPDECLR;
__sfr __banked __at 0x64da CNPDESET;
__sfr __banked __at 0x64db CNPDEINV;
__sfr __banked __at 0x64dc CNCONE;
__sfr __banked __at 0x64dd CNCONECLR;
__sfr __banked __at 0x64de CNCONESET;
__sfr __banked __at 0x64df CNCONEINV;
__sfr __banked __at 0x64e0 CNENE;
__sfr __banked __at 0x64e1 CNENECLR;
__sfr __banked __at 0x64e2 CNENESET;
__sfr __banked __at 0x64e3 CNENEINV;
__sfr __banked __at 0x64e4 CNSTATE;
__sfr __banked __at 0x64e5 CNSTATECLR;
__sfr __banked __at 0x64e6 CNSTATESET;
__sfr __banked __at 0x64e7 CNSTATEINV;
__sfr __banked __at 0x65c0 ANSELF;
__sfr __banked __at 0x65c1 ANSELFCLR;
__sfr __banked __at 0x65c2 ANSELFSET;
__sfr __banked __at 0x65c3 ANSELFINV;
__sfr __banked __at 0x65c4 TRISF;
__sfr __banked __at 0x65c5 TRISFCLR;
__sfr __banked __at 0x65c6 TRISFSET;
__sfr __banked __at 0x65c7 TRISFINV;
__sfr __banked __at 0x65c8 PORTF;
__sfr __banked __at 0x65c9 PORTFCLR;
__sfr __banked __at 0x65ca PORTFSET;
__sfr __banked __at 0x65cb PORTFINV;
__sfr __banked __at 0x65cc LATF;
__sfr __banked __at 0x65cd LATFCLR;
__sfr __banked __at 0x65ce LATFSET;
__sfr __banked __at 0x65cf LATFINV;
__sfr __banked __at 0x65d0 ODCF;
__sfr __banked __at 0x65d1 ODCFCLR;
__sfr __banked __at 0x65d2 ODCFSET;
__sfr __banked __at 0x65d3 ODCFINV;
__sfr __banked __at 0x65d4 CNPUF;
__sfr __banked __at 0x65d5 CNPUFCLR;
__sfr __banked __at 0x65d6 CNPUFSET;
__sfr __banked __at 0x65d7 CNPUFINV;
__sfr __banked __at 0x65d8 CNPDF;
__sfr __banked __at 0x65d9 CNPDFCLR;
__sfr __banked __at 0x65da CNPDFSET;
__sfr __banked __at 0x65db CNPDFINV;
__sfr __banked __at 0x65dc CNCONF;
__sfr __banked __at 0x65dd CNCONFCLR;
__sfr __banked __at 0x65de CNCONFSET;
__sfr __banked __at 0x65df CNCONFINV;
__sfr __banked __at 0x65e0 CNENF;
__sfr __banked __at 0x65e1 CNENFCLR;
__sfr __banked __at 0x65e2 CNENFSET;
__sfr __banked __at 0x65e3 CNENFINV;
__sfr __banked __at 0x65e4 CNSTATF;
__sfr __banked __at 0x65e5 CNSTATFCLR;
__sfr __banked __at 0x65e6 CNSTATFSET;
__sfr __banked __at 0x65e7 CNSTATFINV;
__sfr __banked __at 0x66c0 ANSELG;
__sfr __banked __at 0x66c1 ANSELGCLR;
__sfr __banked __at 0x66c2 ANSELGSET;
__sfr __banked __at 0x66c3 ANSELGINV;
__sfr __banked __at 0x66c4 TRISG;
__sfr __banked __at 0x66c5 TRISGCLR;
__sfr __banked __at 0x66c6 TRISGSET;
__sfr __banked __at 0x66c7 TRISGINV;
__sfr __banked __at 0x66c8 PORTG;
__sfr __banked __at 0x66c9 PORTGCLR;
__sfr __banked __at 0x66ca PORTGSET;
__sfr __banked __at 0x66cb PORTGINV;
__sfr __banked __at 0x66cc LATG;
__sfr __banked __at 0x66cd LATGCLR;
__sfr __banked __at 0x66ce LATGSET;
__sfr __banked __at 0x66cf LATGINV;
__sfr __banked __at 0x66d0 ODCG;
__sfr __banked __at 0x66d1 ODCGCLR;
__sfr __banked __at 0x66d2 ODCGSET;
__sfr __banked __at 0x66d3 ODCGINV;
__sfr __banked __at 0x66d4 CNPUG;
__sfr __banked __at 0x66d5 CNPUGCLR;
__sfr __banked __at 0x66d6 CNPUGSET;
__sfr __banked __at 0x66d7 CNPUGINV;
__sfr __banked __at 0x66d8 CNPDG;
__sfr __banked __at 0x66d9 CNPDGCLR;
__sfr __banked __at 0x66da CNPDGSET;
__sfr __banked __at 0x66db CNPDGINV;
__sfr __banked __at 0x66dc CNCONG;
__sfr __banked __at 0x66dd CNCONGCLR;
__sfr __banked __at 0x66de CNCONGSET;
__sfr __banked __at 0x66df CNCONGINV;
__sfr __banked __at 0x66e0 CNENG;
__sfr __banked __at 0x66e1 CNENGCLR;
__sfr __banked __at 0x66e2 CNENGSET;
__sfr __banked __at 0x66e3 CNENGINV;
__sfr __banked __at 0x66e4 CNSTATG;
__sfr __banked __at 0x66e5 CNSTATGCLR;
__sfr __banked __at 0x66e6 CNSTATGSET;
__sfr __banked __at 0x66e7 CNSTATGINV;
